---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShort
source: html/753b384e-d741-763a-5b47-71eeeef44e3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShort Property

AdjustEdge is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdjustEdgeTooShort { get; }
```